{
  "kind": "build_request",
  "title": "Cartoonish romantic Valentine page with evasive “No”, “Yes” reveal meme, and love letter",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the standalone page (frontend/public/valentine.html) to keep the single-purpose Valentine prompt with “Yes” and an evasive “No” button (moves away on hover/touch), and on “Yes” click reveal: (1) a meme-style cartoon romantic image containing the text “You are my forever, Warda.” and (2) the full love letter content (in English) displayed below the image in a readable, scrollable layout suitable for iPad Chrome.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There should be two options: Yes or No. When she hovers her cursor over No, it should move away so she cannot click it... When she clicks Yes, show her a meme image telling her “you are my forever warda ... and write ... and be fully interactive using HTML, CSS, and JavaScript so that I can easily run it on my iPad using Chrome"
        ]
      },
      "acceptanceCriteria": [
        "Opening /frontend/public/valentine.html shows the question “Will you be my Valentine, my love?” with Yes/No options.",
        "Hovering the cursor over “No” moves it to a new position within the button container; on touch devices, touching “No” also moves it and does not trigger navigation/click.",
        "Clicking “Yes” hides the question view and shows a celebration view that includes: (a) a meme/cartoon romantic image with the embedded text “You are my forever, Warda.” and (b) the provided love letter text rendered as selectable text, laid out for comfortable reading (wrapping, spacing, and scroll if needed).",
        "All content in the celebration view is in English (no non-English text displayed)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the React app Valentine flow (frontend/src/App.tsx) to match the same end-user behavior as the standalone page: keep the evasive “No” behavior, and after clicking “Yes” show the meme-style cartoon romantic image with the embedded text “You are my forever, Warda.” plus the full English love letter content below the image in a mobile/tablet-friendly layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When she clicks Yes, show her a meme image telling her “you are my forever warda ... and write ..."
        ]
      },
      "acceptanceCriteria": [
        "In the React app, the initial view shows the Valentine question with Yes/No, and “No” moves away on hover and on touch/pointer interactions.",
        "After clicking “Yes”, the celebration view shows the meme/cartoon romantic image with embedded text “You are my forever, Warda.” and renders the English love letter text beneath it with appropriate spacing and readability on iPad-sized viewports.",
        "The celebration view supports scrolling if the love letter is longer than the viewport, without content overlap with the footer."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply a consistent cartoonish romantic visual theme across both the standalone page and the React flow (warm pink/red palette, playful rounded shapes, heart accents, soft shadows, and a friendly cartoon-like typographic feel), while keeping the UI simple and focused on the single Valentine question and reveal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "thia page should be cartonish themed romantically scheme"
        ]
      },
      "acceptanceCriteria": [
        "Both experiences (standalone HTML and React) share a cohesive romantic cartoon theme (rounded panels, warm gradients, heart accents, soft shadows).",
        "Typography and spacing make the question and the love letter easy to read on iPad Chrome (no overly small text, no clipped content)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the generated meme-style image as a static asset under frontend/public/assets/generated and reference it from both frontend/public/valentine.html and frontend/src/App.tsx (do not serve images through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "show her a meme image telling her “you are my forever warda”"
        ]
      },
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/valentine-meme-forever-warda.dim_1600x900.png.",
        "Both the standalone page and React celebration view load and display this new image successfully in production builds.",
        "No backend endpoints are added for image delivery."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed as immutable must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; no new backend services or external databases.",
    "Use English for all user-facing text rendered in the app/page."
  ],
  "nonGoals": [
    "Adding authentication (Internet Identity) or any backend persistence.",
    "Adding additional pages/features beyond the Valentine question and the Yes reveal.",
    "Implementing real-time communication, messaging, or social integrations."
  ],
  "imageRequirements": {
    "required": [
      "Meme-style cartoon romantic illustration with a couple, hearts/sparkles, warm pink/red palette, playful vector-like outlines, and the embedded text “You are my forever, Warda.” (valentine-meme-forever-warda.dim_1600x900.png)"
    ],
    "edits": []
  }
}