{
  "kind": "build_request",
  "title": "Cartoonish romantic Valentine surprise page with evasive “No” and “Yes” reveal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deliver a simple, single-purpose Valentine proposal experience that asks the user: “Will you be my Valentine, my love?” and presents exactly two options: “Yes” and “No”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The page should be simple, romantic-themed, and have only one purpose: to ask her to be my Valentine my love . There should be two options: Yes or No."
        ]
      },
      "acceptanceCriteria": [
        "The initial view shows the question “Will you be my Valentine, my love?”",
        "Only two buttons are presented: “Yes” and “No”",
        "The app remains focused on this single interaction (no extra navigation/features added)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the evasive “No” interaction so that the “No” button cannot be clicked: when the user hovers over it with a mouse OR attempts to touch/press it via touch/pointer on iPad, the button moves to a new random position within its container bounds and does not overlap the “Yes” button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she hovers her cursor over No, it should move away so she cannot click it, forcing her to click only on Yes.",
          "be fully interactive using HTML, CSS, and JavaScript so that I can easily run it on my iPad using Chrome"
        ]
      },
      "acceptanceCriteria": [
        "On desktop: moving the cursor onto the “No” button causes it to relocate before it can be clicked",
        "On touch devices (iPad Chrome): attempting to tap/press “No” causes it to relocate and prevents the tap from activating a click",
        "The “No” button always stays within the visible bounds of its intended container",
        "The “No” button never overlaps the “Yes” button after moving"
      ]
    },
    {
      "id": "REQ-3",
      "text": "On clicking “Yes”, switch to a celebration/reveal view that (a) displays a cartoonish romantic meme image containing the text “You are my forever, Warda” and (b) shows the user-provided love letter text in a readable, scroll-friendly layout suitable for iPad Chrome.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she clicks Yes, show her a meme image telling her “you are my forever warda ...” and write i love you warda ill forever love you , you are my life and i would like to say My love, every day with you feels like a gift ..."
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Yes” hides the prompt view and shows a celebration/reveal view",
        "The reveal view contains a meme image with the embedded text “You are my forever, Warda” (case/punctuation as shown)",
        "The reveal view renders the full provided message text and is readable on iPad (mobile typography and spacing)",
        "The love letter area is scrollable if it exceeds the viewport height"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a consistent cartoonish romantic visual theme across both the prompt and celebration views (warm pink/red palette, playful rounded shapes, heart accents, soft shadows, and a friendly cartoon-like typographic feel), while keeping the UI simple and focused.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "thia page should be cartonish themed romantically scheme"
        ]
      },
      "acceptanceCriteria": [
        "Prompt and reveal views share a cohesive cartoonish romantic aesthetic (rounded cards/buttons, heart motifs, soft shadows)",
        "The design remains uncluttered and centered around the Yes/No interaction and the reveal content",
        "The UI remains responsive and comfortable to use on iPad screen sizes"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Provide the experience as a self-contained static page runnable in iPad Chrome by maintaining/updating the standalone file at frontend/public/valentine.html (HTML/CSS/JS) and ensure the meme image is referenced as a static asset under frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "be fully interactive using HTML, CSS, and JavaScript so that I can easily run it on my iPad using Chrome"
        ]
      },
      "acceptanceCriteria": [
        "The standalone page frontend/public/valentine.html runs without a backend and contains all required HTML/CSS/JS for the interaction",
        "The standalone page functions correctly when opened/served statically in Chrome on iPad",
        "The meme image is loaded from frontend/public/assets/generated using the exact filename specified in this build request (no backend image serving)"
      ]
    }
  ],
  "constraints": [
    "Do not add or rely on any backend logic; backend/main.mo should remain unnecessary for this feature.",
    "Do not edit frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Do not serve images through the backend; reference generated images as static assets under frontend/public/assets/generated.",
    "Use pointer/touch-compatible interactions (not hover-only) so the evasive “No” behavior works on iPad Chrome."
  ],
  "nonGoals": [
    "Fixing or investigating the prior production deployment error (not requested in the current user message).",
    "Adding authentication (Internet Identity) or any user accounts.",
    "Persisting data, analytics, or storing user responses.",
    "Adding additional pages, routing, or features beyond the Valentine prompt and reveal."
  ],
  "imageRequirements": {
    "required": [
      "Meme-style cartoon romantic illustration with a couple, hearts/sparkles, warm pink/red palette, playful vector-like outlines, and embedded text “You are my forever, Warda.” (valentine-meme-forever-warda.dim_1600x900.png, 1600x900)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}