{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Static cartoonish Valentine proposal page with evasive No and Yes reveal",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render a single-purpose Valentine prompt with the exact question and exactly two options (Yes/No).",
      "acceptanceCriteria": [
        "The initial view shows the question “Will you be my Valentine, my love?”",
        "Only two buttons are presented: “Yes” and “No”",
        "The app remains focused on this single interaction (no extra navigation/features added)"
      ],
      "file_operations": [
        {
          "path": "frontend/public/valentine.html",
          "operation": "modify",
          "description": "Ensure the initial prompt view is the default render, shows the exact question text, and presents only the two buttons (Yes/No). Remove/avoid any extra UI elements that could be perceived as additional features (e.g., non-essential external links) while preserving the romantic theme."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the “No” button evade hover and touch/pointer attempts by moving randomly within bounds without overlapping “Yes”.",
      "acceptanceCriteria": [
        "On desktop: moving the cursor onto the “No” button causes it to relocate before it can be clicked",
        "On touch devices (iPad Chrome): attempting to tap/press “No” causes it to relocate and prevents the tap from activating a click",
        "The “No” button always stays within the visible bounds of its intended container",
        "The “No” button never overlaps the “Yes” button after moving"
      ],
      "file_operations": [
        {
          "path": "frontend/public/valentine.html",
          "operation": "modify",
          "description": "Update the No-button interaction to be pointer/touch compatible: move the No button on mouse hover AND on pointer/touch press attempts (e.g., pointerenter + pointerdown/touchstart), calling preventDefault/stopPropagation to prevent click activation. Constrain random positions to the buttons container bounds and compute a non-overlapping placement relative to the Yes button (retry up to a capped attempt count)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "On Yes click, switch to a celebration view with the specified meme image and a scroll-friendly love letter layout for iPad Chrome.",
      "acceptanceCriteria": [
        "Clicking “Yes” hides the prompt view and shows a celebration/reveal view",
        "The reveal view contains a meme image with the embedded text “You are my forever, Warda” (case/punctuation as shown)",
        "The reveal view renders the full provided message text and is readable on iPad (mobile typography and spacing)",
        "The love letter area is scrollable if it exceeds the viewport height"
      ],
      "file_operations": [
        {
          "path": "frontend/public/valentine.html",
          "operation": "modify",
          "description": "Wire the Yes button to hide the prompt view and reveal the celebration view. Ensure the celebration view loads the meme image from frontend/public/assets/generated/valentine-meme-forever-warda.dim_1600x900.png and the love letter is displayed with readable mobile-first typography and a scrollable container when content exceeds the viewport."
        },
        {
          "path": "frontend/public/assets/generated/valentine-meme-forever-warda.dim_1600x900.png",
          "operation": "create",
          "description": "Add the required generated meme image asset so the standalone page can load it statically from frontend/public/assets/generated/valentine-meme-forever-warda.dim_1600x900.png."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a cohesive cartoonish romantic theme across prompt and reveal views while keeping the UI uncluttered and iPad-friendly.",
      "acceptanceCriteria": [
        "Prompt and reveal views share a cohesive cartoonish romantic aesthetic (rounded cards/buttons, heart motifs, soft shadows)",
        "The design remains uncluttered and centered around the Yes/No interaction and the reveal content",
        "The UI remains responsive and comfortable to use on iPad screen sizes"
      ],
      "file_operations": [
        {
          "path": "frontend/public/valentine.html",
          "operation": "modify",
          "description": "Unify styling across both views with a warm pink/red palette, rounded playful shapes, heart accents, and soft shadows. Ensure responsive sizing (especially button tap targets and typography) for iPad Chrome while keeping layout centered and minimal."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Deliver the feature as a self-contained static page in frontend/public/valentine.html and reference the meme image as a static generated asset.",
      "acceptanceCriteria": [
        "The standalone page frontend/public/valentine.html runs without a backend and contains all required HTML/CSS/JS for the interaction",
        "The standalone page functions correctly when opened/served statically in Chrome on iPad",
        "The meme image is loaded from frontend/public/assets/generated using the exact filename specified in this build request (no backend image serving)"
      ],
      "file_operations": [
        {
          "path": "frontend/public/valentine.html",
          "operation": "modify",
          "description": "Ensure valentine.html remains fully standalone (all required HTML/CSS/JS embedded or local) with no backend dependencies, and that the meme image reference resolves to frontend/public/assets/generated/valentine-meme-forever-warda.dim_1600x900.png when served/opened statically (iPad Chrome compatible)."
        }
      ]
    }
  ]
}